tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Emacs dependency management
brew "cask"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# OpenType text shaping engine
brew "harfbuzz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Software environment for statistical computing
brew "r"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Data science software focusing on R and Python
cask "rstudio"
# Open-source code editor
cask "visual-studio-code"
vscode "ms-vsliveshare.vsliveshare"
vscode "reditorsupport.r"
